ELL-case-template/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mesh generation steps
castellatedMesh false;
snap            false;
addLayers       true;

geometry
{
    wall_bellmouth
    {
        type            patch;
        name            wall_bellmouth;
    }

    inlet
    {
        type patch;
        name inlet; 
    }

    outlet
    {
        type patch;
        name outlet; 
    }

    symmetry_bottom
    {
        type symmetryPlane;
        name symmetry_bottom; 
    }

    topEmptyFaces
    {
        type empty;
        name topEmptyFaces; 
    }
    bottomEmptyFaces
    {
        type empty;
        name bottomEmptyFaces; 
    }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 20;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    // Feature edge refinement
    features
    (

    );
    refinementSurfaces 
    {

    }
    refinementRegions
    {
        
    }

    locationInMesh (12.5 12.5 0.005);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;

    protectedPatches
    (
    );
}



snapControls 
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;

    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes false;       // Use relative sizes for layer thicknesses

    layers
    {
        wall_bellmouth
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.05;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;

    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1;
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

// Merging tolerance
mergeTolerance 1e-6;