ELL-case-template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 0;
    }
	
    outlet
    {
        type            fixedValue;
        value           uniform -128;
    }
	
	frontAndBack
    {
        type            empty;
    }

	symmetry
	{
		type			symmetryPlane;
	}
	
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
