ELL-case-template/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

outlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

symmetry_bottom.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

wall_bellmouth.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

FrontAndBackPlanes.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}


// ************************************************************************* //
